In [1]:
import pandas as pd

In [6]:
data = [1,2,3,4,5]

series = pd.Series(data)
print("the series are = \n",series)

the series are =
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# series from dictinory

data = {"a" : 10,"b" : 20, "c" : 30}

series = pd.Series(data)
print(series)

a    10
b    20
c    30
dtype: int64

In [11]:
data = [10,20,30,40,50]
series = pd.Series(data, index=[1,2,3,4,5])
print(series)

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [16]:
data = {
        "Name" : ["Rushikesh" , "JK" , "Swapnil" , "Atharva"],
        "Age" : [25,23,29,21],
        "City" : ["PUNE","KERLA","MUMBAI","Yavat"]
}

df = pd.DataFrame(data,index=[1,2,3,4])
print(df)
print(type(df))

        Name  Age    City
1  Rushikesh   25    PUNE
2         JK   23   KERLA
3    Swapnil   29  MUMBAI
4    Atharva   21   Yavat
<class 'pandas.core.frame.DataFrame'>

In [17]:
result = pd.Series(12,index=[1,2,3])
print(result)

1    12
2    12
3    12
dtype: int64

In [28]:
s1 = pd.Series([1,2,3],index=[1,2,3])
s2 = pd.Series([1,2,3],index =[1,2,3])
print(s1+s2)

1    2
2    4
3    6
dtype: int64

DataFrame

In [24]:
list = [1,2,3,4,5]
result = pd.DataFrame(list,index=[1,2,3,4,5])
print(result)

   0
1  1
2  2
3  3
4  4
5  5

In [32]:
# Geting a specific columns

dict_1 = {
            "A" : [1,2,3,4],
            "B" : [5,6,7,8],
            "C" : [9,10,11,12]
}
result = pd.DataFrame(dict_1,index=[1,2,3,4],columns=["A","C"])
print(result)

   A   C
1  1   9
2  2  10
3  3  11
4  4  12

In [42]:
#Getting a particular element

dict_1 = {
            "A" : [1,2,3,4],
            "B" : [5,6,7,8],
            "C" : [9,10,11,12]
}

result = pd.DataFrame(dict_1,index=[1,2,3,4],columns=["A","C"])
get_element = result.loc[2,"C"]
get_element

10

In [51]:
# Converting Series to DataFrame

list = {"S1" : pd.Series([1,2,3,4]),
        "s2" : pd.Series([5,6,7,8])
       }
result = pd.DataFrame(list )

result

   S1  s2
0   1   5
1   2   6
2   3   7
3   4   8

In [55]:
# Arithmatic operations , Adding of 2 column 

dict = {
            "A" : [1,2,3,4],
            "B" : [5,6,7,8]
}
result = pd.DataFrame(dict , index=[1,2,3,4])
result["A + B"] = result["A"] + result["B"]
result

   A  B  A + B
1  1  5      6
2  2  6      8
3  3  7     10
4  4  8     12

In [70]:
# Converting float to int

dict = {
        "A" : [17,25,33],
        "B" : [4,5,63]
}
result = pd.DataFrame(dict , index=[1,2,3])
result["A + B"] = result["A"] / result["B"]
result.astype(int) # convert float to int

    A   B    A + B
1  17   4  4.25000
2  25   5  5.00000
3  33  63  0.52381

In [77]:
# Filter DataFrame

filter_DataFrame = {
                    "A" : [1,2,3,4,5],
                    "B" : [6,7,8,9,10]
}
filter_result = pd.DataFrame(filter_DataFrame , index=[1,2,3,4,5])
filter_result["Filter_A"]= filter_result["A"].where(filter_result["A"]>3)
filter_result

   A   B  Filter_A
1  1   6       NaN
2  2   7       NaN
3  3   8       NaN
4  4   9       4.0
5  5  10       5.0

In [87]:
filter_DataFrame = {
                    "A" : [22,10,30,80,5],
                    "B" : [6,7,8,9,10]
}
filter_result = pd.DataFrame(filter_DataFrame , index=[1,2,3,4,5])
filter_result["Filter_A"] = filter_result["A"].where(filter_result["A"] %2 == 0 )
filter_result

    A   B  Filter_A
1  22   6      22.0
2  10   7      10.0
3  30   8      30.0
4  80   9      80.0
5   5  10       NaN

In [99]:
# Insert a element

df = {
            "A" : [1,2,3],
            "C" : [4,5,6]
}
df_result = pd.DataFrame(df , index=[1,2,3])
# df_result.insert(2,"C",[7,8,9]) # insert through list
df_result.insert(1,"B",df_result["A"]) # Copy directly from column
df_result

   A  B  C
1  1  1  4
2  2  2  5
3  3  3  6

In [102]:
# Insert a element

df = {
            "A" : [1,2,3],
            "C" : [4,5,6]
}
df_result = pd.DataFrame(df , index=[1,2,3])
# df_result.insert(2,"C",[7,8,9]) # insert through list
df_result.insert(1,"D",df_result["A"][0:2]) # Copy by using range
df_result

   A    D  C
1  1  1.0  4
2  2  2.0  5
3  3  NaN  6

In [103]:
del df_result["C"]
df_result

   A    D
1  1  1.0
2  2  2.0
3  3  NaN

In [104]:
# Write a CSV File

data = pd.DataFrame({
            "A" : [10,20,30,40],
            "B" : [11,22,33,44]
} , index=[1,2,3,4])
data.to_csv("Demo_Write_CSV" , header=False)
data

    A   B
1  10  11
2  20  22
3  30  33
4  40  44

In [105]:
# data_header = pd.DataFrame({
#                 "A" : [11,22,33],
#                 "B" : [1,2,3]
# })

# data_header.to_csv("Header_CSV" , header=("Value of A","Value of B"))
# data_header

    A  B
0  11  1
1  22  2
2  33  3

In [165]:
# Read CSV


data = pd.read_csv("C:/Users/rusare/Downloads/Spark_CSV_File.csv" , index_col= 0)

data.reset_index(inplace=True) # EmpID column name he neet yet navta mhanun index reset kela
data

   EmpID    EmpName       City  Salary Remark
0      1  Rushikesh       Pune  290000      A
1      2         JK      Kerla   32000      B
2      3     Manish     Alibag   45000      A
3      4    Atharva      Patas   21000      C
4      5   Abhishek  Bangalore   25000      D
5      6    Swapnil     Mumbai   43000      A
6      7     Piyush   Hadapsar   78000      D
7      8    Harshad     Mumbai   65000      B
8      9    Sourabh       Pune   21000      C
9     10  Prathmesh     Mumbai   10000      D

In [ ]:
# Getting an Specific rows

data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" , nrows=2 , index_col=0)
data.reset_index(inplace=True)
data

  Remark  Max_Salary  Min_Salary
0      A      290000       43000
1      B       65000       32000

In [162]:
# getting a specific columns

data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" , index_col=0 , usecols=["Min_Salary"])
data

Empty DataFrame
Columns: []
Index: [43000, 32000, 21000, 10000]

In [ ]:
# getting a multiple columns

data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" , index_col=0 , usecols=["Remark","Min_Salary"])
data.reset_index(inplace=True)
data

  Remark  Min_Salary
0      A       43000
1      B       32000
2      C       21000
3      D       10000

In [ ]:
# getting a particular rows using heade

data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" , index_col=0 , header=2)
data.reset_index(inplace=True)
data

   B  65000  32000
0  C  21000  21000
1  D  78000  10000

In [ ]:
# Changing a datatype 

data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" , dtype={"Min_Salary":float} )
data

  Remark  Max_Salary  Min_Salary
0      A      290000     43000.0
1      B       65000     32000.0
2      C       21000     21000.0
3      D       78000     10000.0

In [176]:
data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" )
data.head(2)

  Remark  Max_Salary  Min_Salary
0      A      290000       43000
1      B       65000       32000

In [ ]:
data.columns
data.describe()
data.tail(1)

  Remark  Max_Salary  Min_Salary
3      D       78000       10000

In [185]:
data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" )
data[1:3]

  Remark  Max_Salary  Min_Salary
1      B       65000       32000
2      C       21000       21000

In [ ]:
# Convert pandas to numpy

import pandas as pd

data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" )
data.to_numpy()

array([['A', 290000, 43000],
       ['B', 65000, 32000],
       ['C', 21000, 21000],
       ['D', 78000, 10000]], dtype=object)

In [10]:
data.index.array

<PandasArray>
[0, 1, 2, 3]
Length: 4, dtype: int64

In [ ]:
# Sorting index

data.sort_index(axis=0 , ascending= False)

  Remark  Max_Salary  Min_Salary
3      D       78000       10000
2      C       21000       21000
1      B       65000       32000
0      A      290000       43000

In [38]:
# do the nename on columns

data.rename(columns={"Max_Salary":"Max","Min_Salary":"Min"})

  Remark     Max    Min      Max
0      A  290000  43000  50000.0
1      B   65000  32000      NaN
2      C   21000  21000      NaN
3      D   78000  10000      NaN

In [181]:
# update the data using loc() function

# data = pd.read_csv("C:/Users/rusare/Downloads/export.csv" )
# data.loc[1,"Min_Salary"] = 15000
data.loc[0]

Remark             A
Max_Salary    290000
Min_Salary     43000
Name: 0, dtype: object

In [ ]:
# Getting a specific value ( data)

data.iloc[2,1] # integer-location based indexing

data.loc[3,"Min_Salary"] # label based indexing

10000

In [ ]:
# Getting a multiple element

data.loc[[1,3],["Max_Salary","Min_Salary"]]

   Max_Salary  Min_Salary
1       65000       15000
3       78000       10000

In [116]:
# Delete a column 

data.drop("decision",axis=1,inplace=True)

In [152]:
data = pd.read_csv("C:\\Users\\rusare\\Downloads\\Power BI\\Sales_Copy.csv")
data

,Order Line,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Product ID,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-BO-10001798,261.9600,2.0,0.00,41.9136
1,2,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-CH-10000454,731.9400,3.0,NaN,219.5820
2,3,CA-2016-138688,12-06-2016,16-06-2016,Second Class,DV-13045,OFF-LA-10000240,14.6200,NaN,0.00,6.8714
3,4,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,FUR-TA-10000577,957.5775,5.0,0.45,NaN
4,5,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,OFF-ST-10000760,22.3680,2.0,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...
195,196,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004685,7.4080,2.0,0.20,NaN
196,197,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004027,6.0480,3.0,0.20,1.5876
197,198,CA-2017-107720,06-11-2017,13-11-2017,Standard Class,VM-21685,OFF-ST-10001414,46.2600,3.0,0.00,12.0276
198,199,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-BI-10000343,2.9460,2.0,0.70,NaN
199,200,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-PA-10002749,16.0560,NaN,0.20,5.8203

In [154]:
data.dropna(how="all")

,Order Line,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Product ID,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-BO-10001798,261.9600,2.0,0.00,41.9136
1,2,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-CH-10000454,731.9400,3.0,NaN,219.5820
2,3,CA-2016-138688,12-06-2016,16-06-2016,Second Class,DV-13045,OFF-LA-10000240,14.6200,NaN,0.00,6.8714
3,4,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,FUR-TA-10000577,957.5775,5.0,0.45,NaN
4,5,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,OFF-ST-10000760,22.3680,2.0,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...
195,196,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004685,7.4080,2.0,0.20,NaN
196,197,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004027,6.0480,3.0,0.20,1.5876
197,198,CA-2017-107720,06-11-2017,13-11-2017,Standard Class,VM-21685,OFF-ST-10001414,46.2600,3.0,0.00,12.0276
198,199,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-BI-10000343,2.9460,2.0,0.70,NaN
199,200,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-PA-10002749,16.0560,NaN,0.20,5.8203

In [ ]:
data.dropna(subset=["Quantity","Profit"])

,Order Line,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Product ID,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-BO-10001798,261.960,2.0,0.0,41.9136
1,2,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-CH-10000454,731.940,3.0,NaN,219.5820
4,5,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,OFF-ST-10000760,22.368,2.0,0.2,2.5164
6,7,CA-2014-115812,09-06-2014,14-06-2014,Standard Class,BH-11710,OFF-AR-10002833,7.280,4.0,0.0,1.9656
8,9,CA-2014-115812,09-06-2014,14-06-2014,Standard Class,BH-11710,OFF-BI-10003910,18.504,3.0,0.2,5.7825
...,...,...,...,...,...,...,...,...,...,...,...
190,191,CA-2015-102281,12-10-2015,14-10-2015,First Class,MP-17470,TEC-PH-10001552,71.760,6.0,0.0,20.0928
193,194,CA-2015-102281,12-10-2015,14-10-2015,First Class,MP-17470,OFF-AR-10003514,19.900,5.0,0.0,6.5670
194,195,CA-2015-131457,31-10-2015,06-11-2015,Standard Class,MZ-17515,OFF-EN-10001509,14.280,7.0,0.0,6.7116
196,197,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004027,6.048,3.0,0.2,1.5876
197,198,CA-2017-107720,06-11-2017,13-11-2017,Standard Class,VM-21685,OFF-ST-10001414,46.260,3.0,0.0,12.0276

In [161]:
data.dropna(how="all")
data.fillna({"Quantity":"Hello","Profit":"Byee"})

,Order Line,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Product ID,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-BO-10001798,261.9600,2.0,0.00,41.9136
1,2,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-CH-10000454,731.9400,3.0,NaN,219.582
2,3,CA-2016-138688,12-06-2016,16-06-2016,Second Class,DV-13045,OFF-LA-10000240,14.6200,Hello,0.00,6.8714
3,4,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,FUR-TA-10000577,957.5775,5.0,0.45,Byee
4,5,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,OFF-ST-10000760,22.3680,2.0,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...
195,196,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004685,7.4080,2.0,0.20,Byee
196,197,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004027,6.0480,3.0,0.20,1.5876
197,198,CA-2017-107720,06-11-2017,13-11-2017,Standard Class,VM-21685,OFF-ST-10001414,46.2600,3.0,0.00,12.0276
198,199,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-BI-10000343,2.9460,2.0,0.70,Byee
199,200,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-PA-10002749,16.0560,Hello,0.20,5.8203

In [177]:
data.isna().sum()

Order Line      0
Order ID        0
Order Date      0
Ship Date       0
Ship Mode       0
Customer ID     0
Product ID      0
Sales           0
Quantity       36
Discount        0
Profit          0
dtype: int64

In [203]:
data.fillna({"Discount":"Hello","Profit":"Bye"},inplace=True)
data

,Order Line,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Product ID,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-BO-10001798,261.9600,2.0,0.0,41.9136
1,2,CA-2016-152156,08-11-2016,11-11-2016,Second Class,CG-12520,FUR-CH-10000454,731.9400,3.0,Hello,219.582
2,3,CA-2016-138688,12-06-2016,16-06-2016,Second Class,DV-13045,OFF-LA-10000240,14.6200,NaN,0.0,6.8714
3,4,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,FUR-TA-10000577,957.5775,5.0,0.45,Bye
4,5,US-2015-108966,11-10-2015,18-10-2015,Standard Class,SO-20335,OFF-ST-10000760,22.3680,2.0,0.2,2.5164
...,...,...,...,...,...,...,...,...,...,...,...
195,196,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004685,7.4080,2.0,0.2,Bye
196,197,CA-2014-140004,21-03-2014,25-03-2014,Standard Class,CB-12025,OFF-AR-10004027,6.0480,3.0,0.2,1.5876
197,198,CA-2017-107720,06-11-2017,13-11-2017,Standard Class,VM-21685,OFF-ST-10001414,46.2600,3.0,0.0,12.0276
198,199,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-BI-10000343,2.9460,2.0,0.7,Bye
199,200,US-2017-124303,06-07-2017,13-07-2017,Standard Class,FH-14365,OFF-PA-10002749,16.0560,NaN,0.2,5.8203

In [ ]:
# Group BY in pandas 
import pandas as pd

df = pd.read_csv("C:/Users/rusare/Downloads/weather_by_cities.csv")
# grouped = df.groupby("city")

# for city , df_city in grouped:
#     print()
#     print(city)
#     print(df_city)

          windspeed  temperature
city
mumbai           37        88.50
new york         32        32.25
paris            51        47.75

In [ ]:
# grouped.max().reset_index()

       city       day  temperature  windspeed  event
0    mumbai  1/4/2017           92         15  Sunny
1  new york  1/4/2017           36         12  Sunny
2     paris  1/4/2017           54         20  Sunny

In [ ]:
# Get multiple groups

df = pd.read_csv("C:/Users/rusare/Downloads/weather_by_cities.csv")

# Filter a data using groupby

# df.groupby("city")

# citites = ["mumbai","paris"]

# filter_group = df[df["city"].isin(citites)]

# filter_group

# *****************************************

# Filter a data using for loop

# cities = ["mumbai","paris"]

# for city in cities:
#     city_group = df[df["city"] == city]
#     print(f"Data For {city.capitalize()}:")
#     print(city_group)
#     print()

Mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
Paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [ ]:
# import pandasql as psql

# df = pd.read_csv("C:/Users/rusare/Downloads/weather_by_cities.csv")

# query = "SELECT city,COUNT(*) as COUNT_City FROM df GROUP BY city"
# result = psql.sqldf(query,locals())
# result

       city  COUNT_City
0    mumbai           4
1  new york           4
2     paris           4

In [ ]:
# Replace function 

# df = pd.read_csv("C:/Users/rusare/Downloads/weather_by_cities.csv")
# df["city"] = df["city"].replace("new york","NYC")

event
Sunny     4
Cloudy    3
Rain      2
Fog       2
Snow      1
Name: count, dtype: int64

In [ ]:
import pandas as pd

df = pd.read_csv("C:/Users/rusare/Downloads/weather_by_cities.csv")
# df.columns
# new_column = []
# for data_column in df.columns:
#     new_column.append(data_column.capitalize())
# df.columns= new_column
# df

# df.columns = [col.capitalize()  for col in df.columns]
# df

Index(['Day', 'City', 'Temperature', 'Windspeed', 'Event'], dtype='object')